libs/soap/tests/soap1-2.xml

<?xml version='1.0' ?>
<!-- Taken from SOAP spec, but with customary 'env' NS prefix deliberately
     changed to 'soap' to test namespace mapping -->
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"> 
 <soap:Header>
  <m:reservation xmlns:m="http://travelcompany.example.org/reservation" 
          soap:role="http://www.w3.org/2003/05/soap-envelope/role/next"
           soap:mustUnderstand="true">
   <m:reference>uuid:093a2da1-q345-739r-ba5d-pqff98fe8j7d</m:reference>
   <m:dateAndTime>2001-11-29T13:20:00.000-05:00</m:dateAndTime>
  </m:reservation>
  <n:passenger xmlns:n="http://mycompany.example.com/employees"
          soap:role="http://www.w3.org/2003/05/soap-envelope/role/next"
           soap:mustUnderstand="true">
   <n:name>Åke Jógvan Øyvind</n:name>
  </n:passenger>
 </soap:Header>
 <soap:Body>
  <p:itinerary
    xmlns:p="http://travelcompany.example.org/reservation/travel">
   <p:departure>
     <p:departing>New York</p:departing>
     <p:arriving>Los Angeles</p:arriving>
     <p:departureDate>2001-12-14</p:departureDate>
     <p:departureTime>late afternoon</p:departureTime>
     <p:seatPreference>aisle</p:seatPreference>
   </p:departure>
   <p:return>
     <p:departing>Los Angeles</p:departing>
     <p:arriving>New York</p:arriving>
     <p:departureDate>2001-12-20</p:departureDate>
     <p:departureTime>mid-morning</p:departureTime>
     <p:seatPreference/>
   </p:return>
  </p:itinerary>
  <q:lodging
   xmlns:q="http://travelcompany.example.org/reservation/hotels">
   <q:preference>none</q:preference>
  </q:lodging>
 </soap:Body>
</soap:Envelope>
